Revit 2027 API
SymbolTypeId.DegreeFInterval Property
 Symbol °F, indicating unit Fahrenheit interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DegreeFInterval { get; }
Public Shared ReadOnly Property DegreeFInterval As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DegreeFInterval {
	ForgeTypeId^ get ();
}
static member DegreeFInterval : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace